org/proxy_send.org
# -*- mode:org; coding: utf-8; -*-
#+TITLE: Proxy_send - send proxy authentication
#+SETUPFILE: header.org
#+PROPERTY: header-args :tangle ../bin/proxy_send.sh :mkdirp t :results no :eval no

* Description
  - This script is automatically called by prady_runcom's profile scripts when network is inferred as /office/.
  - We try to open [[https://www.duckduckgo.com/][duckduckgo]] and send proxy authentication secret.
  - The proxy server generally 'remembers' that our machine was authenticated and
    does not demand proxy authentication again.

* Setup
  Proxy secret may be provided through any of the tools explained in following sections.

  #+begin_note
  - If information is available at both locations, it is loaded in order.
  - Information available from the latter supersedes the former.

  #+end_note

** Password store
   - [[https://www.passwordstore.org][Password manager]] may hold the proxy-secret.
   - Pass-name to the secret *MUST* be stored in an environment variable =${proxy_auth}=.
   - Secret MUST *NOT* be url-encoded.

     - /pass-name/ can be declared by adding following lines to
       =${XDG_CONFIG_HOME:-${HOME/.config}/(pvt|local).d/.<some_name>rc=
       #+begin_seealso
       - [[file:setup.org::*Personalization][Personalization]]
       #+end_seealso

       #+BEGIN_SRC sh :tangle no
         proxy_auth="office/proxy_server.example.com/best_employee"
         export proxy_auth
       #+END_SRC

   - Secret *MUST* be stored in either of following formats.

**** plain password
     Password store stores just the <password>.
     <password> may be stored in password manager using a command such as:
     #+BEGIN_SRC sh :tangle no
       pass insert office/proxy_server.example.com/best_employee
     #+END_SRC

**** multi-field
     Information about /any/ or /all/ of following fields may be provided.
     - Order is not strict.

     #+begin_src yml :tangle no
       protocol: <proxy protocol>
       username: <username in plain text>
       password: <password in plain text>
       address: <proxy server address>
       port: <proxy port>

     #+end_src

     Fields may be stored in password manager using a command such as:
     #+BEGIN_SRC sh :tangle no
       pass insert -m office/proxy_server.example.com/best_employee
     #+END_SRC

** Environment declaration
   - A =${proxy_protocol}= environment variable *may* be declared.
     It can be declared by adding following lines to
     =${XDG_CONFIG_HOME:-${HOME/.config}/(pvt|local).d/.<some_name>rc=

     #+BEGIN_SRC sh :tangle no
       proxy_protocol="http"
       export proxy_protocol

     #+END_SRC

     - Proxy information extraction attempt is made from =${proxy_protocol}_proxy= environment variable
       - e.g. =http_proxy=, =socks_proxy=, etc.
     - If =proxy_protocol= remains unset, extraction is attempted from =all_proxy= and /http/ is used as default.

   - =${<proxy_protocol>_proxy}= should be declared in
     =${XDG_CONFIG_HOME:-${HOME/.config}/(pvt|local).d/.<some_name>rc=.
     - Special characters (symbols) in username and password *MUST* be [[https://en.wikipedia.org/wiki/Percent-encoding][url-encoded]].
     - Its value must be of the form:
       #+begin_example
         <p_type>_proxy="<protocol>://[<encoded_username>[:<encoded_password>]]@<address>[:<port>]/"
       #+end_example

     - example for =all_proxy=
     #+BEGIN_SRC sh :tangle no
       all_proxy="http://best_employee:secure%21secret@192.168.1.1:1080/"
       export all_proxy
     #+END_SRC

     #+begin_danger
     Storing password in environment is strongly *discouraged*.
     #+end_danger

* Code
This section tangles the code (POSIX)
#+begin_src sh :exports none :shebang #!/usr/bin/env sh
  # -*- coding:utf-8; mode:shell-script -*-
  #
  # Copyright (c) 2020-2023 Pradyumna Paranjape
  #
  # This file is part of Prady_runcom.
  #
  # Prady_runcom is free software: you can redistribute it and/or modify
  # it under the terms of the GNU General Public License as published by
  # the Free Software Foundation, either version 3 of the License, or
  # (at your option) any later version.
  #
  # Prady_runcom is distributed in the hope that it will be useful,
  # but WITHOUT ANY WARRANTY; without even the implied warranty of
  # MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  # GNU General Public License for more details.
  #
  # You should have received a copy of the GNU General Public License
  # along with Prady_runcom.  If not, see <https://www.gnu.org/licenses/>.
#+end_src

** Check availability
   #+begin_src sh
     # Confirm that dependencies are available.
     affirm_availability () {
         for _import in curl printenv grep tr; do
             if ! command -v "${_import}" >/dev/null 2>&1; then
                 unset _import
                 clean_exit 127 "${_import} is not installed\n"
             fi
         done
         unset _import
     }

   #+end_src

