docs/proxy_send.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-21 Fri 16:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Proxy_send - send proxy authentication</title>
<meta name="author" content="Pradyumna Paranjape" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Proxy_send - send proxy authentication</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7f5f59f">Description</a></li>
<li><a href="#org72e0c52">Setup</a>
<ul>
<li><a href="#org73ca1dd">Password store</a></li>
<li><a href="#org841fc61">Environment declaration</a></li>
</ul>
</li>
<li><a href="#org1572129">Code</a>
<ul>
<li><a href="#orgad23409">Check availability</a></li>
<li><a href="#org70e48c7">Handle global variables and exits</a></li>
<li><a href="#org88285a4">Parse command</a></li>
<li><a href="#org9edeaae">Extract proxy information from environment variable</a></li>
<li><a href="#org24f9dbc">Compile proxy information</a></li>
<li><a href="#org6268ac1">Html handling</a></li>
<li><a href="#org6bc3ab0">Main routine call</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7f5f59f" class="outline-2">
<h2 id="org7f5f59f">Description</h2>
<div class="outline-text-2" id="text-org7f5f59f">
<ul class="org-ul">
<li>This script is automatically called by prady_runcom&rsquo;s profile scripts when network is inferred as <i>office</i>.</li>
<li>We try to open <a href="https://www.duckduckgo.com/">duckduckgo</a> and send proxy authentication secret.</li>
<li>The proxy server generally &rsquo;remembers&rsquo; that our machine was authenticated and
does not demand proxy authentication again.</li>
</ul>
</div>
</div>

<div id="outline-container-org72e0c52" class="outline-2">
<h2 id="org72e0c52">Setup</h2>
<div class="outline-text-2" id="text-org72e0c52">
<p>
Proxy secret may be provided through any of the tools explained in following sections.
</p>

<div class="note" id="org4a8dbca">
<ul class="org-ul">
<li>If information is available at both locations, it is loaded in order.</li>
<li>Information available from the latter supersedes the former.</li>
</ul>

</div>
</div>

<div id="outline-container-org73ca1dd" class="outline-3">
<h3 id="org73ca1dd">Password store</h3>
<div class="outline-text-3" id="text-org73ca1dd">
<ul class="org-ul">
<li><a href="https://www.passwordstore.org">Password manager</a> may hold the proxy-secret.</li>
<li>Pass-name to the secret <b>MUST</b> be stored in an environment variable <code>${proxy_auth}</code>.</li>
<li>Secret MUST <b>NOT</b> be url-encoded.

<ul class="org-ul">
<li><p>
<i>pass-name</i> can be declared by adding following lines to
<code>${XDG_CONFIG_HOME:-${HOME/.config}/(pvt|local).d/.&lt;some_name&gt;rc</code>
</p>
<div class="seealso" id="orga7b3980">
<ul class="org-ul">
<li><a href="setup.html#org0ea3361">Personalization</a></li>
</ul>

</div>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-variable-name">proxy_auth</span>=<span class="org-string">"office/proxy_server.example.com/best_employee"</span>
<span class="org-builtin">export</span> proxy_auth
</pre>
</div></li>
</ul></li>

<li>Secret <b>MUST</b> be stored in either of following formats.</li>
</ul>
</div>

<ul class="org-ul">
<li><a id="org50d56ba"></a>plain password<br />
<div class="outline-text-5" id="text-org50d56ba">
<p>
Password store stores just the &lt;password&gt;.
&lt;password&gt; may be stored in password manager using a command such as:
</p>
<div class="org-src-container">
<pre class="src src-sh">pass insert office/proxy_server.example.com/best_employee
</pre>
</div>
</div>
</li>

<li><a id="orgc7ad916"></a>multi-field<br />
<div class="outline-text-5" id="text-orgc7ad916">
<p>
Information about <i>any</i> or <i>all</i> of following fields may be provided.
</p>
<ul class="org-ul">
<li>Order is not strict.</li>
</ul>

<div class="org-src-container">
<pre class="src src-yml">protocol: &lt;proxy protocol&gt;
username: &lt;username in plain text&gt;
password: &lt;password in plain text&gt;
address: &lt;proxy server address&gt;
port: &lt;proxy port&gt;

</pre>
</div>

<p>
Fields may be stored in password manager using a command such as:
</p>
<div class="org-src-container">
<pre class="src src-sh">pass insert -m office/proxy_server.example.com/best_employee
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-org841fc61" class="outline-3">
<h3 id="org841fc61">Environment declaration</h3>
<div class="outline-text-3" id="text-org841fc61">
<ul class="org-ul">
<li><p>
A <code>${proxy_protocol}</code> environment variable <b>may</b> be declared.
It can be declared by adding following lines to
<code>${XDG_CONFIG_HOME:-${HOME/.config}/(pvt|local).d/.&lt;some_name&gt;rc</code>
</p>

<div class="org-src-container">
<pre class="src src-sh"><span class="org-variable-name">proxy_protocol</span>=<span class="org-string">"http"</span>
<span class="org-builtin">export</span> proxy_protocol

</pre>
</div>

<ul class="org-ul">
<li>Proxy information extraction attempt is made from <code>${proxy_protocol}_proxy</code> environment variable
<ul class="org-ul">
<li>e.g. <code>http_proxy</code>, <code>socks_proxy</code>, etc.</li>
</ul></li>
<li>If <code>proxy_protocol</code> remains unset, extraction is attempted from <code>all_proxy</code> and <i>http</i> is used as default.</li>
</ul></li>

<li><p>
<code>${&lt;proxy_protocol&gt;_proxy}</code> should be declared in
<code>${XDG_CONFIG_HOME:-${HOME/.config}/(pvt|local).d/.&lt;some_name&gt;rc</code>.
</p>
<ul class="org-ul">
<li>Special characters (symbols) in username and password <b>MUST</b> be <a href="https://en.wikipedia.org/wiki/Percent-encoding">url-encoded</a>.</li>
<li><p>
Its value must be of the form:
</p>
<pre class="example" id="orgdaaf994">
&lt;p_type&gt;_proxy="&lt;protocol&gt;://[&lt;encoded_username&gt;[:&lt;encoded_password&gt;]]@&lt;address&gt;[:&lt;port&gt;]/"
</pre></li>

<li>example for <code>all_proxy</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-variable-name">all_proxy</span>=<span class="org-string">"http://best_employee:secure%21secret@192.168.1.1:1080/"</span>
<span class="org-builtin">export</span> all_proxy
</pre>
</div>

<div class="danger" id="org7ed4514">
<p>
Storing password in environment is strongly <b>discouraged</b>.
</p>

</div></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org1572129" class="outline-2">
<h2 id="org1572129">Code</h2>
<div class="outline-text-2" id="text-org1572129">
<p>
This section tangles the code (POSIX)
</p>
</div>
<div id="outline-container-orgad23409" class="outline-3">
<h3 id="orgad23409">Check availability</h3>
<div class="outline-text-3" id="text-orgad23409">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Confirm that dependencies are available.</span>
<span class="org-function-name">affirm_availability</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">for</span> _import<span class="org-keyword"> in</span> curl printenv grep tr; <span class="org-keyword">do</span>
        <span class="org-keyword">if</span> <span class="org-negation-char">!</span> command -v <span class="org-string">"${_import}"</span> &gt;/dev/null 2&gt;&amp;1; <span class="org-keyword">then</span>
            <span class="org-builtin">unset</span> _import
            clean_exit 127 <span class="org-string">"${_import} is not installed\n"</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">done</span>
    <span class="org-builtin">unset</span> _import
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>
</div>
</div>
