org/proxy_send.org
** Handle global variables and exits
   #+begin_src sh
     # Set clean variables before running script.
     set_vars () {
         # show the sent heder?
         show=false

         # Compiled proxy header
         proxy_header=
         if [ -z "${proxy_protocol}" ]; then
             proxy_protocol='all'
         fi
         proxy_username=
         proxy_password=
         proxy_host=
         proxy_port=

         # help (usage)
         usage="
         usage: ${0} -h
         usage: ${0} --help
         usage: ${0} [Optional Arguments*] INSTANCE
     "

         # help (details)
         help_msg="${usage}

         DESCRIPTION: |
           Auto-send proxy authentication


         Optional Arguments: |
           -h\t\t\tprint usage message and exit
           --help\t\t\tprint this help message and exit
           -s|--show\tdisplay what will be sent as header, don't send

     "
     }

     # Unsetset local variables to clean the environment.
     unset_vars() {
         unset help_msg
         unset usage
         unset show
         unset proxy_port
         unset proxy_host
         unset proxy_password
         unset proxy_username
         unset pass_keys
         unset proxy_header
     }


     # Clean environment and exit optionally with an exit error code
     clean_exit() {
         unset_vars
         if [ -n "${1}" ] && [ "${1}" -ne "0" ]; then
             if [ -n "${2}" ]; then
                 # shellcheck disable=SC2059
                 printf "${2}\n" >&2
             fi
             # shellcheck disable=SC2086
             exit ${1}
         fi
         if [ -n "${2}" ]; then
             # shellcheck disable=SC2059
             printf "${2}\n"
         fi
         exit 0
     }
   #+end_src

** Parse command
   #+begin_src sh
     # Parse command line arguments
     cli () {
         while [ $# -gt 0 ]; do
             case "${1}" in
                 -h)
                     # shellcheck disable=SC2059
                     clean_exit 0 "${usage}"
                     ;;
                 --help)
                     # shellcheck disable=SC2059
                     clean_exit 0 "${help_msg}"
                     ;;
                 -s|--show)
                     show=true
                     shift
                     ;;
                 ,*)
                     clean_exit 1 "${usage}"
             esac
         done
     }
   #+end_src

