docs/proxy_send.html

<div id="outline-container-org70e48c7" class="outline-3">
<h3 id="org70e48c7">Handle global variables and exits</h3>
<div class="outline-text-3" id="text-org70e48c7">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Set clean variables before running script.</span>
<span class="org-function-name">set_vars</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">show the sent heder?</span>
    <span class="org-variable-name">show</span>=false

    <span class="org-comment-delimiter"># </span><span class="org-comment">Compiled proxy header</span>
    <span class="org-variable-name">proxy_header</span>=
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${proxy_protocol}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">proxy_protocol</span>=<span class="org-string">'all'</span>
    <span class="org-keyword">fi</span>
    <span class="org-variable-name">proxy_username</span>=
    <span class="org-variable-name">proxy_password</span>=
    <span class="org-variable-name">proxy_host</span>=
    <span class="org-variable-name">proxy_port</span>=

    <span class="org-comment-delimiter"># </span><span class="org-comment">help (usage)</span>
    <span class="org-variable-name">usage</span>=<span class="org-string">"</span>
<span class="org-string">    usage: ${0} -h</span>
<span class="org-string">    usage: ${0} --help</span>
<span class="org-string">    usage: ${0} [Optional Arguments*] INSTANCE</span>
<span class="org-string">"</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">help (details)</span>
    <span class="org-variable-name">help_msg</span>=<span class="org-string">"${usage}</span>

<span class="org-string">    DESCRIPTION: |</span>
<span class="org-string">      Auto-send proxy authentication</span>


<span class="org-string">    Optional Arguments: |</span>
<span class="org-string">      -h\t\t\tprint usage message and exit</span>
<span class="org-string">      --help\t\t\tprint this help message and exit</span>
<span class="org-string">      -s|--show\tdisplay what will be sent as header, don't send</span>

<span class="org-string">"</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Unsetset local variables to clean the environment.</span>
<span class="org-function-name">unset_vars</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-builtin">unset</span> help_msg
    <span class="org-builtin">unset</span> usage
    <span class="org-builtin">unset</span> show
    <span class="org-builtin">unset</span> proxy_port
    <span class="org-builtin">unset</span> proxy_host
    <span class="org-builtin">unset</span> proxy_password
    <span class="org-builtin">unset</span> proxy_username
    <span class="org-builtin">unset</span> pass_keys
    <span class="org-builtin">unset</span> proxy_header
<span class="org-rainbow-delimiters-depth-1">}</span>


<span class="org-comment-delimiter"># </span><span class="org-comment">Clean environment and exit optionally with an exit error code</span>
<span class="org-function-name">clean_exit</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    unset_vars
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${1}"</span> <span class="org-rainbow-delimiters-depth-2">]</span> &amp;&amp; <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${1}"</span> -ne <span class="org-string">"0"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${2}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
            <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2059</span>
            printf <span class="org-string">"${2}\n"</span> &gt;&amp;2
        <span class="org-keyword">fi</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2086</span>
        <span class="org-keyword">exit</span> $<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-variable-name">1</span><span class="org-rainbow-delimiters-depth-2">}</span>
    <span class="org-keyword">fi</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${2}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2059</span>
        printf <span class="org-string">"${2}\n"</span>
    <span class="org-keyword">fi</span>
    <span class="org-keyword">exit</span> 0
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org88285a4" class="outline-3">
<h3 id="org88285a4">Parse command</h3>
<div class="outline-text-3" id="text-org88285a4">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Parse command line arguments</span>
<span class="org-function-name">cli</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">while</span> <span class="org-rainbow-delimiters-depth-2">[</span> $<span class="org-variable-name">#</span> -gt 0 <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">do</span>
        <span class="org-keyword">case</span> <span class="org-string">"${1}"</span><span class="org-keyword"> in</span>
            -h)
                <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2059</span>
                clean_exit 0 <span class="org-string">"${usage}"</span>
                ;;
            --help)
                <span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2059</span>
                clean_exit 0 <span class="org-string">"${help_msg}"</span>
                ;;
            -s|--show)
                <span class="org-variable-name">show</span>=true
                <span class="org-builtin">shift</span>
                ;;
            *)
                clean_exit 1 <span class="org-string">"${usage}"</span>
        <span class="org-keyword">esac</span>
    <span class="org-keyword">done</span>
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>
