org/proxy_send.org
** Extract proxy information from environment variable
   #+begin_src sh
     # extract from env variable
     extract_env () {
         url="${1}"
         # keep consuming URL like $@ is consumed from command line
         _proto="$(printf "%s" "${url}" | grep :// | sed -e 's,^\(.*\)://.*,\1,g')"
         url="${url#"${_proto}"://}"  # - protocol
         userpass="$(printf "%s" "${url}" | grep @ | cut -d@ -f1)"
         _user="${userpass%:*}"
         _pass="$(printf "%s" "${userpass}" | grep : | sed -e 's,^.*\?:\(.*\),\1,g')"
         url="$(printf "%s" "${url##"${userpass}"@}" | cut -d/ -f1)"  # - credentials
         _host="${url%:*}"
         _port="$(printf "%s" "${url}" | \grep '[0-9]' | sed -e 's,^.*:\([0-9]\+\)$,\1,')"
         if [ -n "${_proto}" ]; then
             proxy_protocol="${_proto}"
         fi

         if [ -n "${_user}" ]; then
             proxy_username="${_user}"
         fi

         if [ -n "${_pass}" ]; then
             proxy_password="${_pass}"
         fi

         if [ -n "${_host}" ]; then
             proxy_host="${_host}"
         fi

         if [ -n "${_port}" ]; then
             proxy_port="${_port}"
         fi

          unset _port _host _pass _user _proto userpass url
     }

     # Retrieve from env
     get_env_proxy () {
         # Parse environment variable.
         proxy_str="$(printenv "${proxy_protocol}_proxy")"
         if [ -z "${proxy_str}" ]; then
             return
         fi
         extract_env "${proxy_str}"
         unset proxy_str
     }
   #+end_src

** Compile proxy information
   #+begin_src sh
     # build proxy
     build () {
         all_proxy="$("${RUNCOMDIR:-${HOME}/.runcom}"/bin/proxy_extract.sh)"
         extract_env "${all_proxy}"
         get_env_proxy
     }

     # Compile proxy header
     compile_proxy () {
         if [ -z "${proxy_host}" ]; then
             return
         fi
         if [ -n "${proxy_protocol}" ]; then
             if [ "${proxy_protocol}" = "all" ]; then
                 proxy_header="http://"
             else
                 proxy_header="${proxy_protocol}://"
             fi
         fi
         if [ -n "${proxy_username}" ]; then
             scrt="${proxy_username}"
             if [ -n "${proxy_password}" ]; then
                 scrt="${proxy_username}:${proxy_password}"
             fi
             proxy_header="${proxy_header}${scrt}@"
         fi
         proxy_header="${proxy_header}${proxy_host}"
         if [ -n "${proxy_port}" ]; then
             proxy_header="${proxy_header}:${proxy_port}"
         fi
         proxy_header="${proxy_header}/"
         unset scrt
     }
   #+end_src

** Html handling
   #+begin_src sh
     # Convert plain-text value into html quoted form.
     quote () {
         printf "%s" "$1" \
             | tr -d '\n' \
             | curl -Gso /dev/null -w "%{url_effective}" --data-urlencode @- "" \
             | cut -c 3-
     }

     # Send a request to duckduckgo.com
     send_request () {
         curl -sLf -x "${proxy_header}" "https://www.duckduckgo.com/" >/dev/null 2>&1
         case $? in
             0)
                 clean_exit
                 ;;
             6)
                 # Couldn't resolve
                 clean_exit 6
                 ;;
             7)
                 # No route to proxy_host
                 clean_exit
                 ;;
             ,*)
                 # other error
                 clean_exit "$?"
                 ;;
         esac
     }

   #+end_src

