docs/proxy_send.html

<div id="outline-container-org9edeaae" class="outline-3">
<h3 id="org9edeaae">Extract proxy information from environment variable</h3>
<div class="outline-text-3" id="text-org9edeaae">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">extract from env variable</span>
<span class="org-function-name">extract_env</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">url</span>=<span class="org-string">"${1}"</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">keep consuming URL like $@ is consumed from command line</span>
    <span class="org-variable-name">_proto</span>=<span class="org-string">"$(printf "%s" "${url}" | grep :// | sed -e 's,^\(.*\)://.*,\1,g')"</span>
    <span class="org-variable-name">url</span>=<span class="org-string">"${url#"</span>$<span class="org-rainbow-delimiters-depth-2">{</span><span class="org-variable-name">_proto</span><span class="org-rainbow-delimiters-depth-2">}</span><span class="org-string">"://}"</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">- protocol</span>
    <span class="org-variable-name">userpass</span>=<span class="org-string">"$(printf "%s" "${url}" | grep @ | cut -d@ -f1)"</span>
    <span class="org-variable-name">_user</span>=<span class="org-string">"${userpass%:*}"</span>
    <span class="org-variable-name">_pass</span>=<span class="org-string">"$(printf "%s" "${userpass}" | grep : | sed -e 's,^.*\?:\(.*\),\1,g')"</span>
    <span class="org-variable-name">url</span>=<span class="org-string">"$(printf "%s" "${url##"${userpass}"@}" | cut -d/ -f1)"</span>  <span class="org-comment-delimiter"># </span><span class="org-comment">- credentials</span>
    <span class="org-variable-name">_host</span>=<span class="org-string">"${url%:*}"</span>
    <span class="org-variable-name">_port</span>=<span class="org-string">"$(printf "%s" "${url}" | \grep '[0-9]' | sed -e 's,^.*:\([0-9]\+\)$,\1,')"</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${_proto}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">proxy_protocol</span>=<span class="org-string">"${_proto}"</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${_user}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">proxy_username</span>=<span class="org-string">"${_user}"</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${_pass}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">proxy_password</span>=<span class="org-string">"${_pass}"</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${_host}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">proxy_host</span>=<span class="org-string">"${_host}"</span>
    <span class="org-keyword">fi</span>

    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${_port}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">proxy_port</span>=<span class="org-string">"${_port}"</span>
    <span class="org-keyword">fi</span>

     <span class="org-builtin">unset</span> _port _host _pass _user _proto userpass url
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Retrieve from env</span>
<span class="org-function-name">get_env_proxy</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">Parse environment variable.</span>
    <span class="org-variable-name">proxy_str</span>=<span class="org-string">"$(printenv "${proxy_protocol}_proxy")"</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${proxy_str}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span>
    <span class="org-keyword">fi</span>
    extract_env <span class="org-string">"${proxy_str}"</span>
    <span class="org-builtin">unset</span> proxy_str
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org24f9dbc" class="outline-3">
<h3 id="org24f9dbc">Compile proxy information</h3>
<div class="outline-text-3" id="text-org24f9dbc">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">build proxy</span>
<span class="org-function-name">build</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">all_proxy</span>=<span class="org-string">"$("${RUNCOMDIR:-${HOME}/.runcom}"/bin/proxy_extract.sh)"</span>
    extract_env <span class="org-string">"${all_proxy}"</span>
    get_env_proxy
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Compile proxy header</span>
<span class="org-function-name">compile_proxy</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -z <span class="org-string">"${proxy_host}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-keyword">return</span>
    <span class="org-keyword">fi</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${proxy_protocol}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-string">"${proxy_protocol}"</span> = <span class="org-string">"all"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
            <span class="org-variable-name">proxy_header</span>=<span class="org-string">"http://"</span>
        <span class="org-keyword">else</span>
            <span class="org-variable-name">proxy_header</span>=<span class="org-string">"${proxy_protocol}://"</span>
        <span class="org-keyword">fi</span>
    <span class="org-keyword">fi</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${proxy_username}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">scrt</span>=<span class="org-string">"${proxy_username}"</span>
        <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${proxy_password}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
            <span class="org-variable-name">scrt</span>=<span class="org-string">"${proxy_username}:${proxy_password}"</span>
        <span class="org-keyword">fi</span>
        <span class="org-variable-name">proxy_header</span>=<span class="org-string">"${proxy_header}${scrt}@"</span>
    <span class="org-keyword">fi</span>
    <span class="org-variable-name">proxy_header</span>=<span class="org-string">"${proxy_header}${proxy_host}"</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${proxy_port}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-variable-name">proxy_header</span>=<span class="org-string">"${proxy_header}:${proxy_port}"</span>
    <span class="org-keyword">fi</span>
    <span class="org-variable-name">proxy_header</span>=<span class="org-string">"${proxy_header}/"</span>
    <span class="org-builtin">unset</span> scrt
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6268ac1" class="outline-3">
<h3 id="org6268ac1">Html handling</h3>
<div class="outline-text-3" id="text-org6268ac1">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Convert plain-text value into html quoted form.</span>
<span class="org-function-name">quote</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    printf <span class="org-string">"%s"</span> <span class="org-string">"$1"</span> <span class="org-sh-escaped-newline">\</span>
        | tr -d <span class="org-string">'\n'</span> <span class="org-sh-escaped-newline">\</span>
        | curl -Gso /dev/null -w <span class="org-string">"%{url_effective}"</span> --data-urlencode @- <span class="org-string">""</span> <span class="org-sh-escaped-newline">\</span>
        | cut -c 3-
<span class="org-rainbow-delimiters-depth-1">}</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Send a request to duckduckgo.com</span>
<span class="org-function-name">send_request</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    curl -sLf -x <span class="org-string">"${proxy_header}"</span> <span class="org-string">"https://www.duckduckgo.com/"</span> &gt;/dev/null 2&gt;&amp;1
    <span class="org-keyword">case</span> $<span class="org-variable-name">?</span><span class="org-keyword"> in</span>
        0)
            clean_exit
            ;;
        6)
            <span class="org-comment-delimiter"># </span><span class="org-comment">Couldn't resolve</span>
            clean_exit 6
            ;;
        7)
            <span class="org-comment-delimiter"># </span><span class="org-comment">No route to proxy_host</span>
            clean_exit
            ;;
        *)
            <span class="org-comment-delimiter"># </span><span class="org-comment">other error</span>
            clean_exit <span class="org-string">"$?"</span>
            ;;
    <span class="org-keyword">esac</span>
<span class="org-rainbow-delimiters-depth-1">}</span>

</pre>
</div>
</div>
</div>
