org/proxy_send.org
** Main routine call
   #+begin_src sh
     # Main routine call
     main() {
         affirm_availability
         set_vars
         cli "$@"
         build
         compile_proxy
         if $show; then
             printf "auth: '%s'\n" "${proxy_header}"
             clean_exit
         fi
         send_request
         clean_exit
     }

     main "$@"
   #+end_src
