docs/proxy_send.html

<div id="outline-container-org6bc3ab0" class="outline-3">
<h3 id="org6bc3ab0">Main routine call</h3>
<div class="outline-text-3" id="text-org6bc3ab0">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">Main routine call</span>
<span class="org-function-name">main</span><span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    affirm_availability
    set_vars
    cli <span class="org-string">"$@"</span>
    build
    compile_proxy
    <span class="org-keyword">if</span> $<span class="org-variable-name">show</span>; <span class="org-keyword">then</span>
        printf <span class="org-string">"auth: '%s'\n"</span> <span class="org-string">"${proxy_header}"</span>
        clean_exit
    <span class="org-keyword">fi</span>
    send_request
    clean_exit
<span class="org-rainbow-delimiters-depth-1">}</span>

main <span class="org-string">"$@"</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>